{
  "navbar": {
    "sectionOne": [
      {
        "title": "Home",
        "icon": "/images/Home.png",
        "link": "/"
      },
      {
        "title": "Search",
        "icon": "/images/Search.png",
        "link": "/search"
      }
    ],
    "Quick Browse": [
      {
        "title": "Projects",
        "icon": "/images/Projects.png",
        "link": "/projects"
      },
      {
        "title": "About Me",
        "icon": "/images/ProfileButtonImage.jpg",
        "link": "/about"
      },
      {
        "title": "Contact Me",
        "icon": "/images/ContactMe.png",
        "link": "/contact"
      }
    ],
    "My Links": [
      {
        "title": "LinkedIn",
        "icon": "/images/LinkedIn.png",
        "link": "https://www.linkedin.com/in/tylerbe/"
      },
      {
        "title": "Github",
        "icon": "/images/Github.png",
        "link": "https://www.github.com/TylerBeach"
      },
      {
        "title": "Email",
        "icon": "/images/Email.png",
        "link": "mailto:tabeach@ualberta.ca"
  
      },
      {
        "title": "Resume",
        "icon": "/images/Resume.png",
        "link": "/resume"
      }
    ],
    "Spotify Links": [
      {
        "title": "My Spotify",
        "icon": "/images/Spotify.png",
        "link": "https://open.spotify.com/user/impoona"
      },
      {
        "title": "EDM",
        "icon": "/images/House.png",
        "link": "https://open.spotify.com/playlist/6AgKp1uhxAubwcz4hgvFpN?si=c8d62009bd2d4ee6"
      },
      {
        "title": "Lofi",
        "icon": "/images/Lofi.png",
        "link": "https://open.spotify.com/playlist/4w9CwgUyxc7bSH8S24draO?si=dbd4a57917834a0b"
      },
      {
        "title": "Chilling",
        "icon": "/images/Chilling.png",
        "link": "https://open.spotify.com/playlist/5qiAWYzhjGo7Sh1BrLYMxy?si=f53a2a08498f4934"
      }
    ]
}, 
  "projects": [
    {
      "id": "MediMinutes",
      "title": "MediMinutes",
      "cardDescription": "Medical quiz application that allows users to test their knowledge on medical topics",
      "paragraphData": [
        {
          "paragraphTitle": "Inspiration",
          "paragraphContent": "The prospect of creating an educational platform for medical professionals that is not only accessible, but also high quality was of great inspiration to our team. We decided to join MediHacks2024 to create incentives for continuous learning and practice for front-line professionals. As computer science students, we understand the importance of keeping on top of a constantly changing and evolving field. Accessible learning is also an issue our team holds in high regard as some of us are from first-generation immigrant families and faced significant barriers ourselves being the first members of our families to attend post-secondary."
        },
        {
          "paragraphTitle": "What it does",
          "paragraphContent": "Our group made a medical education application that allows users to take lessons on over 200 topics ranging from infectious diseases to environmental health."
        },
        {
          "paragraphTitle": "How we built it",
          "paragraphContent": "We worked with Next.js, Javascript, and Tailwind-CSS to program the MediMinutes web application, as well as Python for backend scripting and Figma for UI/UX design. We started by creating Python scripts to scrape sites for medical data which we then stored in our Firebase database to allow ease of access from our frontend. We then passed our data to OpenAI's generative text API to generate a bank of questions specific to each topic. This enabled us to make a quiz feature which tests the users' knowledge by pulling 5 random questions from the bank pertaining to each individual topic. Once we had created the framework for a working web application, we did a visual update based on a complete wireframe we had developed in Figma."
        },
        {
          "paragraphTitle": "Challenges we ran into",
          "paragraphContent": "One of the most significant challenges we encountered was the limited time available to us. With a tight deadline, we had to define a clear vision for the project in order to prioritize tasks and streamline our platform; cutting extra features in order to strengthen core aspects of the application. Incorporating all our ideas proved to be another challenge, as we grappled with balancing creativity and feasibility within our project timeline. Technical challenges also presented themselves throughout the development process. We struggled to find a reliable API to achieve the vision our team had initially. We overcame this challenge by web scraping and processing over 20,000 lines of data from the World Health Organization, ensuring accurate and comprehensive data collection. We also handled smaller issues with coding, design layouts, and user experience optimization, requiring us to adapt and solve problems on the fly."
        },
        {
          "paragraphTitle": "Accomplishments that we're proud of",
          "paragraphContent": "Despite these challenges, we remained committed to our vision of accessible education. Through perseverance, collaboration, and creative problem-solving, we were able to overcome obstacles and bring our project to fruition. Some of our proudest moments during this project were: Creating an automated web-scraping script to collect data for lessons, Integration of AI tools to generate question banks, and our original hand-designed art sprites, logo, and mascot Frankie the frog."
        },
        {
          "paragraphTitle": "What we learned",
          "paragraphContent": "Throughout the process of building this project, we delved deep into the annals of medical knowledge, uncovering key insights into public health, and made lasting impacts on the STEM landscape. At every turn, we were continuously inspired by the breadth and depth of medicine."
        },
        {
          "paragraphTitle": "What's next for MediMinutes",
          "paragraphContent": "We have several new features planned for MediMinutes: Mobile Application Support, Lesson series specifically focusing on pharmaceutical drugs, Larger courses taught with the assistance of medical professionals in the field. In the very future of MediMinutes we would like to branch out beyond medical-related topics to other STEM fields. We believe it is important to foster connections and collaboration within the STEM ecosystem. To that end, we will explore partnerships with educational institutions, organizations, and industry leaders to amplify the impact of our platform and create opportunities for mentorship, networking, and professional development. We will continually update the website with the thousands of new contributions that are being made by health professionals in STEM fields every day. By providing a dynamic and evolving platform, we hope to inspire future generations and foster a deeper appreciation for medicine and innovation."
        }
      ],
      "link": "https://github.com/MediHacks24/MediMinutes",
      "hostedLink": "https://medi-minutes.vercel.app/",
      "imageURL": "/images/projectImages/quizTimeFrog10.png",
      "bannerURL": "/images/projectImages/MediMinBanner.png",
      "demoImages": [
        {"image": "/images/projectImages/MediMinHomePage.png", "caption": "Home Page"},
        {"image": "/images/projectImages/MediMinCategoryPage.png", "caption": "Categories"},
        {"image": "/images/projectImages/MediMinSectionPage.png", "caption": "Reading Section"},
        {"image": "/images/projectImages/MediMinQuizPage.png", "caption": "Quiz Preface"},
        {"image": "/images/projectImages/MediMinQuizEndPage.png", "caption": "Quiz Completion"},
        {"image": "/images/projectImages/OurTeam.png", "caption": "Our Team"}


      ],
      "techStack": ["Next.js", "Javascript", "Tailwind", "Python", "Firebase", "Figma"],
      "date": "July 2024"
    },
    {
      "id": "AlgorithmTutor",
      "title": "Algorithm Tutor",
      "cardDescription": "An algorithm that allows users to visualize algorithms as they run step by step.",  
      "paragraphData": [
        {
          "paragraphTitle": "What is it?",
          "paragraphContent": "Algorithm Visualizer is a web application that allows users to visualize algorithms in action. Users can select from a variety of algorithms and see how they work step by step. The application was created as a personal project to help users learn about algorithms in a fun and interactive way. The goal of the project was to create a tool that would make learning about algorithms more accessible and engaging for users."
        },
        {
          "paragraphTitle": "What can it do?",
          "paragraphContent": "Algorithm Visualizer allows users to select from a variety of algorithms including sorting algorithms, searching algorithms, and array operatios. Users can see how the algorithms work step by step and learn about the different techniques used to solve problems. The application also includes a step by step code example for the algorithm being visualized. It also has many custom settings such as speed, array size, forward and backward buttons. Users can stop and start the visualization at any time to see how the algorithm works in real time." 
        },
        {
          "paragraphTitle": "How was it built?",
          "paragraphContent": "Algorithm Visualizer was built using Next.js, a React framework. The application uses Javascript and Tailwind CSS for styling. The algorithms are implemented in Javascript and are visualized using custom animations. The application is hosted on Vercel and is available to users on the web. The project was created as a personal project to help users learn about algorithms in a fun and interactive way. The goal of the project was to create a tool that would make learning about algorithms more accessible and engaging for users."
        },
        {
          "paragraphTitle": "Future Plans",
          "paragraphContent": "In the future, I plan to add more sorting algorithms and other data structures such as trees and stacks. I also plan to add more custom settings such as color themes and animations. I hope to continue working on the project and add more features over time."
        }
      ],
      "link": null,
      "hostedLink": "https://algorithm-tutor.vercel.app/",
     
      "imageURL" : "/images/projectImages/AlgorithmTutor.webp",
      "bannerURL" : "/images/projectImages/AlgorithmTutorBanner.png",
      "demoImages": [
        {"image": "/images/projectImages/AlgorithmVisualizer2.png", "caption": "Home Page" },
        {"image": "/images/projectImages/SortingExampleVideo3.gif", "caption": "Sorting Example" },
        {"image": "/images/projectImages/PathingExampleVideo2.gif", "caption": "Pathfinding Example" },
        {"image": "/images/projectImages/ArraysExampleVideo2.gif", "caption": "Array Operations" }
      ],
      "techStack":["Next.js", "Javascript", "Tailwind"],
      "date": "June 2024"
    },
    {
      "id": "StoryTeller",
      "title": "Story Teller",
      "cardDescription": "An AI powered story generator that creates unique stories with the click of a button.",  
      "paragraphData": [
        {
          "paragraphTitle": "What is it?",
          "paragraphContent": "StoryTeller is a web application that allows users to create stories. Leveraging the power of ai, users can generate unique stories with the click of a button. It was created during Hacked one of the biggest Hackathons in Alberta, Canada at the University of Alberta. Our five person team had a goal to implement as many AI tools as possible to create a unique and fun experience for users. "
        },
        {
          "paragraphTitle": "How does it work?",
          "paragraphContent": "StoryTeller uses openAI's generative text model to generate stories. Users can input a prompt and the model will generate a story based on the prompt. It is also capable of generating images that go along with your story using Stable Diffusion! Not to mention the read along feature that allows you to listen to your story using Eleven Labs Text to Speech!"
        }
      ],
      "link": "https://github.com/Active-Transport/story-time",
      "imageURL" : "/images/projectImages/StoryTellerIcon.png",
      "bannerURL" : "/images/projectImages/StoryTellerBanner.png",
      "demoImages": [
        {"image": "/images/projectImages/StoryTellerOne.png", "caption": "StoryTeller Home Page" },
        {"image": "/images/projectImages/StoryTellerTwo.png", "caption": "Story Prompt Input" },
        {"image": "/images/projectImages/StoryTellerThree.jpg", "caption": "Generated Story Example" }
      ],
      "techStack":["React", "Javascript", "CSS", "Python", "Flask"],
      "date": "January 2024"
    },
    {
      "id": "EventHorizon",
      "title": "Event Horizon",
      "cardDescription": "Android mobile app event manager that allows users to create and manage events",  
      "paragraphData": [
        {
          "paragraphTitle": "What is it?",
          "paragraphContent": "Event Horizon is a sophisticated Android mobile application designed to simplify the process of event management for users. The app allows users to create, manage, and participate in events with ease, making it a powerful tool for both personal and professional use. Whether it's a small gathering or a large-scale event, users can set up events, invite participants, and manage RSVPs all within the app. Event Horizon was developed as a final project for CMPUT 301 - Software Engineering at the University of Alberta. The project aimed to apply the principles and practices learned throughout the course in a real-world scenario, resulting in an application that not only meets course objectives but also provides practical value to users."
        },
        {
          "paragraphTitle": "How does it work?",
          "paragraphContent": "Event Horizon leverages Firebase as its backend to handle user authentication, store event data, and manage real-time updates. When a user creates an event, the details are securely stored in Firebase, ensuring that all participants have access to the most current information. The app allows users to invite friends through their contact list or by sharing event links, making it easy to gather participants. Additionally, Event Horizon integrates with Google Maps, providing users with a visual representation of event locations. This integration allows users to view the event's location directly within the app, receive directions, and even check in upon arrival. The combination of Firebase and Google Maps makes Event Horizon a robust and user-friendly solution for managing and attending events, ensuring users stay connected and informed."
        },
        {
          "paragraphTitle": "Software Engineering Design Patterns",
          "paragraphContent": "Event Horizon was meticulously designed using several key software engineering design patterns to ensure the application is efficient, scalable, and maintainable. The Model-View-Controller (MVC) pattern was employed to separate concerns within the app, ensuring that the data (Model), user interface (View), and application logic (Controller) are handled independently. This separation not only makes the app easier to manage and extend but also enhances its testability. The Adapter pattern was utilized to allow the app to interface seamlessly with various APIs, such as Firebase and Google Maps, by converting their data formats into a format the application can easily handle. Furthermore, the Singleton pattern was implemented for managing instances of Firebase, ensuring a single point of access to the database, which enhances performance and reduces the risk of data inconsistencies. These patterns were integral to the development of Event Horizon, allowing the team to apply theoretical knowledge in a practical, real-world project. They also mirror industry practices, providing the team with valuable experience in building scalable and maintainable software."
        },
        {
          "paragraphTitle": "User Experience and Interface Design",
          "paragraphContent": "Event Horizon was designed with a strong focus on user experience (UX) and interface design. The app's interface was created using Figma, ensuring a clean, intuitive, and accessible design. User flows were carefully planned to minimize friction, making it easy for users to create, manage, and join events. The design was iteratively tested and refined based on user feedback, ensuring that the app meets the needs of a diverse user base. By prioritizing UX, Event Horizon not only provides a functional tool but also an enjoyable and seamless experience for its users."
        }
        
      ],

      "link": "https://github.com/CMPUT301W24T09/fire-and-based",
      "imageURL" : "/images/projectImages/EventHorizonLogo.jpg",
      "bannerURL" : "/images/projectImages/EventHorizonBanner.webp",
      "demoImages": [
        {"image": "/images/projectImages/EventHorizon.png", "caption" : "Browse events tab" },
        {"image": "/images/projectImages/EventHorizon2.png", "caption" : "Check in map for an event" },
        {"image": "/images/projectImages/EventHorizon3.png", "caption" : "Event QR code interface" }
      ],
      "techStack":["Java", "Firebase", "Google Maps", "Github", "Figma"],
      "date": "April 2024"
    },
    {
      "id": "FireSafe",
      "title": "FireSafe",
      "cardDescription": "Forest fire software that uses machine learning to locate secluded locations and homes",  
      "paragraphData": [
        {
          "paragraphTitle": "What is FireSafe?",
          "paragraphContent": "FireSafe is an application designed to keep individuals in high risk areas updated on fires. It also ensures that no individual gets left behind in the event of a forest fire eruption. FireSafe uses complex machine learning to locate secluded locations and homes, allowing responders to go down a checklist of locations and ensure individuals are all aware of fire threat and prepared to evacuate."
        },
        {
          "paragraphTitle": "Some Features",
          "paragraphContent": "FireSafe uses machine learning to locate secluded locations and homes. It also ensures that no individual gets left behind in the event of a forest fire eruption. FireSafe uses machine learning to locate secluded locations and homes. It also shows the potential risk of a fire and the radius in which it will potentially reach."
        },
        {
          "paragraphTitle": "Video presentation",
          "paragraphContent": "<a href='https://youtu.be/G8i-fJkVXjM'>Check out our video presentation here</a>"
        }
      ],
      "link": "https://github.com/TylerBeach/FireSafe",
      "imageURL" : "/images/projectImages/FireSafeLogo.png",
      "bannerURL" : "/images/projectImages/FireSafeBanner.png",
      "demoImages": [
        {"image": "/images/projectImages/firesafe-three.png", "caption": "Home Page"},
        {"image": "/images/projectImages/firesafe-two.png", "caption": "Application Page"}
      ],
      "techStack":["Python", "Typescript", "HTML", "CSS", "Tensorflow"],
      "date": "December 2022"
    },
    {
      "id": "FroggyJumper",
      "title": "Froggy Jumper",
      "cardDescription": "2D side scroller game where you play as a frog and jump over snakes to collect flies",  
      "paragraphData": [
        {
          "paragraphTitle": "What is Froggy Jumper?",
          "paragraphContent": "Froggy Jumper is a fast paced side scroller where your objective to survive as long as you can. The game is simple, jump over the snakes and collect the flies. The longer you survive the faster the game gets."
        },
        {
          "paragraphTitle": "Why 'Froggy' Jumper?",
          "paragraphContent": "To put it simple I love frogs! I think they are the coolest animals on the planet. I wanted to make a game that was fun and simple to play. I also wanted to make a game that was challenging and fun to play. I hope you enjoy playing Froggy Jumper as much as I enjoyed making it."
        }
      ],
      "link": "https://github.com/TylerBeach/Froggy-Jumper",
      "imageURL" : "/images/projectImages/FroggyJumperLogo.png",
      "bannerURL" : "/images/projectImages/FroggyJumperBanner.png",
      "demoImages": [
        {"image": "/images/projectImages/FroggyJumperGIF.gif", "caption" : "Gameplay" },
        {"image": "/images/projectImages/FroggyJumperHomeScreen.png", "caption" : "Home screen" }
      ],
      "techStack":["Python", "Pygame"],
      "date": "November 2022"
    },
    {
      "id": "TwitterBackend",
      "title": "Twitter Backend",
      "cardDescription": "Twitter backend clone that allows users to create tweets, follow users, and like tweets using SQL",  
      "paragraphData": [
        {
          "paragraphTitle": "What is it?",
          "paragraphContent": "Twitter Backend is a backend clone of Twitter that allows users to create tweets, follow users, and like tweets. This was a project for CMPUT 291 - File and Database Management at the University of Alberta with a team of four people working together Our group had to design the database schema given the requirements and then implement it to make a functioning backend."},
        {
          "paragraphTitle": "What I learned",
          "paragraphContent": "I learned about developing a database schema for a project and how to implement it to make a functioning backend. I also learned how relational databases work and how to use SQL to interact with the database. This project was a great learning experience and I am excited to continue learning more about databases and backend development throughout my future career in software developement."
        }
      ],
      "link": "https://github.com/TylerBeach/Twitter-Backend-Clone",
      "imageURL" : "/images/Twitter.png",
      "bannerURL" : "/images/projectImages/TwitterCloneBanner.png",
      "demoImages": [
       
      ],
      "techStack":["Python", "SQL"],
      "date": "December 2023"
    }
  ],
  "about": {
    "id": "about",
    "firstName": "Tyler",
    "lastName": "Beach",
    "bannerURL": "/images/profileBanner2.jpg",
    "title": "About Me",
    "courseWork": [
      {"CMPUT 174": "Foundations of Computation"},
      {"CMPUT 175": "Foundations of Computation II"},
      {"CMPUT 201":  "Programming Methodology in C"},
      {"CMPUT 204":  "Algorithms and Data Structures"},
      {"CMPUT 206":  "Digital Image Processing"},
      {"CMPUT 229":  "Computer Organization and Architecture"},
      {"CMPUT 267":  "Machine Learning"},
      {"CMPUT 272":  "Formal Systems and Logic"},
      {"CMPUT 291":  "File and Database Management"},
      {"CMPUT 301":  "Software Engineering"},
      {"CMPUT 365":  "Reinforcement Learning"},
      {"CMPUT 404":  "Web Applications and Architecture"},
      {"CMPUT 455": "Search, Knowledge and Simulation"},
      {"CMPUT 461": "Intro to Natural Language Processing"}
    ],
    
    "paragraphs": [
      {
        "title": "Background",
        "image": "/images/Goals.png",
        "paragraphContent": "Tyler Beach is a dedicated and passionate 23-year-old computing science student residing in Edmonton, Canada. Currently in his fourth year at the University of Alberta, Tyler has cultivated a deep interest in software development, with a particular focus on front-end technologies like React. His technical versatility extends to multiple programming languages, including Python, Java, and C, as well as a growing expertise in backend technologies such as Express. Tyler's commitment to continuous learning and personal growth is evident through his proactive involvement in various personal and academic projects. Outside of his academic pursuits, Tyler is known for his love of frogs, which reflects his appreciation for nature and the environment. As he looks forward to starting his professional career, Tyler is eager to leverage his skills and knowledge in a dynamic and challenging work environment."
      },
      {
        "title": "Education",
        "image": "/images/Education.png",
        "paragraphContent": "Tyler is a fourth year student at the University of Alberta studying Computing Science. He has a passion for software development and is always looking for new ways to improve his skills. Tyler is currently looking for a winter internship in software development to further his skills and gain experience in the field."
      },
      {
        "title": "Technologies",
        "image": "/images/Technology.png",
        "paragraphContent": "Tyler has developed a strong proficiency in front-end development, particularly with React. In addition to his expertise in JavaScript, he is skilled in Python, Java, and C, which enables him to approach problems from multiple technical perspectives. He is continuously expanding his knowledge and is currently delving into backend technologies such as Express to evolve into a comprehensive full-stack developer. Tyler's project portfolio includes <a href='/projects/EventHorizon'>Event Horizon</a>, an Android application developed with Java and Firebase; <a href='/projects/StoryTeller'>Story Teller</a>, a React and Flask-based web application for generating and narrating children's stories; and <a href='/projects/FireSafe'>FireSafe</a>, a real-time forest fire alert system built with Python, TypeScript, and TensorFlow. For a detailed overview of his skills and experience, please refer to his <a href='/resume'>resume</a>."
      },
      {
        "title": "Experience",
        "image": "/images/Briefcase.png",
        "paragraphContent": "While Tyler is in the early stages of his career and has yet to gain professional experience in software development, he has been proactive in building a strong foundation through a variety of personal and academic projects. These projects have allowed him to develop practical skills and demonstrate his ability to work with different technologies. For example, he created <a href='/projects/EventHorizon'>Event Horizon</a>, an Android application for event check-ins, leveraging Java and Firebase. He also developed <a href='/projects/StoryTeller'>Story Teller</a>, a web app using React and Flask to generate and narrate children's stories. Tyler is enthusiastic about applying his skills in a professional environment and is actively seeking opportunities to gain industry experience."
      },
      {
        "title": "The Dream",
        "image": "/images/froggy.jpg",
        "paragraphContent": "Tyler's dream is to work as a software engineer for Microsoft or Spotify. He is passionate about creating innovative software solutions that have a positive impact on people's lives. Tyler is excited about the opportunity to work with cutting-edge technologies and collaborate with talented professionals to develop world-class software products. He is a dedicated and hardworking individual who is committed to continuous learning and personal growth. Tyler is confident that he has the skills and determination to succeed in a competitive industry and is eager to embark on a rewarding career in software development."
      }
    
    ],
    "link": "/about"
  }
}
